CSI API ETABS v1

# cPointElmGetObj Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetObj(
    	string Name,
    	ref string Obj,
    	ref int ObjType
    )

    Function GetObj (
    	Name As String,
    	ByRef Obj As String,
    	ByRef ObjType As Integer
    ) As Integer

    Dim instance As cPointElm
    Dim Name As String
    Dim Obj As String
    Dim ObjType As Integer
    Dim returnValue As Integer

    returnValue = instance.GetObj(Name, Obj,
    	ObjType)

    int GetObj(
    	String^ Name,
    	String^% Obj,
    	int% ObjType
    )

    abstract GetObj :
            Name : string *
            Obj : string byref *
            ObjType : int byref -> int

#### Parameters

Name

    Type: SystemString

Obj

    Type: SystemString

ObjType

    Type: SystemInt32

#### Return Value

Type: Int32

See Also

#### Reference

cPointElm Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com